In [1]:
import numpy as np
import pandas as pd

In [2]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [5]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [6]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

## Working with Dates

In [7]:
# Converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])

In [8]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

#### 1.Extract Year

In [9]:
date['date_year'] = date['date'].dt.year

date.sample(5)

          date  product_id  city_id  orders  date_year
480 2019-02-06        3835        9       2       2019
757 2019-11-11        5848       13       4       2019
71  2019-03-30        2918       26       3       2019
351 2018-12-23        2056       28       1       2018
474 2019-11-01        3967        2      12       2019

#### 2.Extract Month

In [10]:
date["date_moth"]=date["date"].dt.month
date.sample(5)

          date  product_id  city_id  orders  date_year  date_moth
729 2018-12-15        4478       26       1       2018         12
616 2019-02-09        5733       25       2       2019          2
669 2018-10-31        1647        4       1       2018         10
81  2019-03-22        3143       25       1       2019          3
631 2019-06-30        4323        4       7       2019          6

In [12]:
date["date_month"]=date["date"].dt.month_name()
date.sample(5)

          date  product_id  city_id  orders  date_year  date_moth date_month
778 2018-12-13        2235       16      14       2018         12   December
697 2019-10-10        3582       26       2       2019         10    October
831 2019-06-20         652       25       5       2019          6       June
579 2018-08-13        7059       14      31       2018          8     August
721 2019-06-13        1944       11       6       2019          6       June

In [13]:
date["date_day"]=date["date"].dt.day
date.sample(5)

,date,product_id,city_id,orders,date_year,date_moth,date_month,date_day
524,2019-12-01,370,13,7,2019,12,December,1
106,2019-01-20,6592,25,11,2019,1,January,20
420,2018-08-07,7288,14,5,2018,8,August,7
3,2019-08-17,7292,25,1,2019,8,August,17
901,2019-07-24,7148,16,9,2019,7,July,24

In [16]:
#day of week
date["date_dow"]=date["date"].dt.dayofweek

date.sample(5)

,date,product_id,city_id,orders,date_year,date_moth,date_month,date_day,date_dow
726,2019-10-20,5794,6,1,2019,10,October,20,6
93,2019-11-12,7354,25,16,2019,11,November,12,1
7,2019-03-27,5022,2,41,2019,3,March,27,2
511,2018-12-02,1403,29,3,2018,12,December,2,6
772,2018-11-05,6845,13,3,2018,11,November,5,0

In [19]:
#day of week - name
date["date_dayname"]=date["date"].dt.day_name()

date.drop(columns=["product_id","city_id","orders"]).head()

        date  date_year  date_moth date_month  date_day  date_dow date_dayname
0 2019-12-10       2019         12   December        10         1      Tuesday
1 2018-08-15       2018          8     August        15         2    Wednesday
2 2018-10-23       2018         10    October        23         1      Tuesday
3 2019-08-17       2019          8     August        17         5     Saturday
4 2019-01-06       2019          1    January         6         6       Sunday

In [22]:
#is weekend..?
date['date_is_weekend'] = np.where(date['date_dayname'].isin(['Sunday', 'Saturday']), 1,0)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_moth,date_month,date_day,date_dow,date_dayname,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

### Extract Quarter

In [25]:
#Extract quarter
date["date_quarter"]=date["date"].dt.quarter
date.drop(columns=["product_id","orders","city_id"]).head()

,date,date_year,date_moth,date_month,date_day,date_dow,date_dayname,date_is_weekend,date_quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,1

### Extract week

In [29]:
date['date_week'] = date['date'].dt.isocalendar

# date.drop(columns=['product_id','city_id','orders']).head()

### Extract Semester

In [31]:
date["semester"]=np.where(date["date_quarter"].isin([1,2]),1,2)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_moth,date_month,date_day,date_dow,date_dayname,date_is_weekend,date_quarter,date_week,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,4,<bound method DatetimeProperties.isocalendar o...,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,3,<bound method DatetimeProperties.isocalendar o...,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,4,<bound method DatetimeProperties.isocalendar o...,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,3,<bound method DatetimeProperties.isocalendar o...,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,<bound method DatetimeProperties.isocalendar o...,1

### Extract time elapsed between dates

In [33]:
import datetime

today=datetime.datetime.today()

In [34]:
today

datetime.datetime(2024, 1, 6, 16, 8, 33, 59104)

In [35]:
today-date["date"]

0     1488 days 16:08:33.059104
1     1970 days 16:08:33.059104
2     1901 days 16:08:33.059104
3     1603 days 16:08:33.059104
4     1826 days 16:08:33.059104
                 ...
995   1916 days 16:08:33.059104
996   1857 days 16:08:33.059104
997   1705 days 16:08:33.059104
998   1770 days 16:08:33.059104
999   1544 days 16:08:33.059104
Name: date, Length: 1000, dtype: timedelta64[ns]

In [36]:
(today-date["date"]).dt.days

0      1488
1      1970
2      1901
3      1603
4      1826
       ...
995    1916
996    1857
997    1705
998    1770
999    1544
Name: date, Length: 1000, dtype: int64

In [37]:
# Months passed

np.round((today -date['date']) / np.timedelta64(1, 'M'),0)

0      48.0
1      64.0
2      61.0
3      52.0
4      59.0
       ...
995    62.0
996    60.0
997    55.0
998    57.0
999    50.0
Name: date, Length: 1000, dtype: float64

## Working With time

In [38]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [39]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [40]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [41]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

### Extract Time Part

In [42]:
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

### Time Difference

In [43]:
today-time["date"]

0     3674 days 15:18:33.059104
1     3538 days 16:28:33.059104
2     4024 days 15:47:33.059104
3     3326 days 15:37:33.059104
4     3723 days 16:57:33.059104
                 ...
995   4313 days 15:18:33.059104
996   3634 days 16:54:33.059104
997   4099 days 16:31:33.059104
998   4215 days 16:34:33.059104
999   3487 days 16:43:33.059104
Name: date, Length: 1000, dtype: timedelta64[ns]

In [44]:
# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      3.174887e+08
1      3.057425e+08
2      3.477305e+08
3      2.874227e+08
4      3.217283e+08
           ...
995    3.726983e+08
996    3.140385e+08
997    3.542131e+08
998    3.642357e+08
999    3.013370e+08
Name: date, Length: 1000, dtype: float64

In [45]:
# in minutes

(today - time['date'])/np.timedelta64(1,'m')

0      5.291479e+06
1      5.095709e+06
2      5.795508e+06
3      4.790378e+06
4      5.362138e+06
           ...
995    6.211639e+06
996    5.233975e+06
997    5.903552e+06
998    6.070595e+06
999    5.022284e+06
Name: date, Length: 1000, dtype: float64

In [46]:
# in hours

(today - time['date'])/np.timedelta64(1,'h')

0       88191.309183
1       84928.475850
2       96591.792516
3       79839.625850
4       89368.959183
           ...
995    103527.309183
996     87232.909183
997     98392.525850
998    101176.575850
999     83704.725850
Name: date, Length: 1000, dtype: float64

# Conclude